---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.TargetRebarConstraintType.RebarPlane
enum: Autodesk.Revit.DB.Structure.TargetRebarConstraintType
source: html/b5eb20bf-e887-41b4-f15c-0c1860799a8b.htm
---
# Autodesk.Revit.DB.Structure.TargetRebarConstraintType.RebarPlane

Handle is constrained to the location of the other Rebar's primary plane.
 Drives location of the entire Rebar along the direction of its normal.